Revit 2027 API
UpdaterRegistry.SetExecutionOrder Method
 Forces execution order between two updaters Execution order: first before second
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetExecutionOrder(
	UpdaterId first,
	UpdaterId second
)
Public Shared Sub SetExecutionOrder (
	first As UpdaterId,
	second As UpdaterId
)
public:
static void SetExecutionOrder(
	UpdaterId^ first,
	UpdaterId^ second
)
static member SetExecutionOrder :
        first : UpdaterId *
        second : UpdaterId -> unit
Parameters
first UpdaterId
 Id of first Updater
second UpdaterId
 Id of second Updater
Exceptions
Exception | Condition
ArgumentException |  One or both inputs are not valid UpdaterIds -or- One or both of the Updaters are not registered -or- first and second are the same id
ArgumentNullException |  A non-optional argument was null
ArgumentsInconsistentException |  The updaters do not report the same ChangePriority
See Also
Reference
UpdaterRegistry Class
Autodesk.Revit.DB Namespace